	var aCity = new Array();
			aCity[0] = new Array();
			aCity[1] = new Array();
			aCity[2] = new Array();
			aCity[3] = new Array();
			aCity[4] = new Array();
			aCity[5] = new Array();
			aCity[6] = new Array();
			aCity[7] = new Array();
			aCity[8] = new Array();
			aCity[9] = new Array();
			aCity[10] = new Array();
			aCity[11] = new Array();
			aCity[12] = new Array();
			aCity[13] = new Array();
			aCity[14] = new Array();
			aCity[15] = new Array();
			aCity[16] = new Array();
			aCity[17] = new Array();
			aCity[18] = new Array();
			aCity[19] = new Array();
			aCity[20] = new Array();
			aCity[21] = new Array();
			aCity[22] = new Array();
			aCity[23] = new Array();
			aCity[24] = new Array();
			aCity[25] = new Array();
			aCity[26] = new Array();
			aCity[27] = new Array();
			aCity[28] = new Array();
			aCity[29] = new Array();
			aCity[30] = new Array();
			aCity[31] = new Array();
			aCity[32] = new Array();
			aCity[33] = new Array();
			aCity[34] = new Array();

			//赋值，每个省份的城市存放于数组的第一行
			aCity[0][0] = "--请选择--";

			aCity[1][0] = "--请选择--";
			aCity[1][1] = " 长沙市  ";
			aCity[1][2] = "郴州市 ";
			aCity[1][3] = "娄底市 ";
			aCity[1][4] = "衡阳市 ";
			aCity[1][5] = "株洲市";
			aCity[1][6] = " 湘潭市  ";
			aCity[1][7] = "岳阳市 ";
			aCity[1][8] = "常德市 ";
			aCity[1][9] = "邵阳市 ";
			aCity[1][10] = "益阳市";
			aCity[1][11] = "永州市   ";
			aCity[1][12] = "张家界 ";
			aCity[1][13] = "怀化市 ";

			aCity[2] = ["--请选择--", "武汉市", " 宜昌市", " 黄石市", " 十堰市 ", "襄樊市", " 鄂州市", " 黄冈市", " 荆门市", " 孝感市", " 荆州市", " 仙桃市", " 咸宁市", " 随州市", " 恩施州 ", "潜江市", " 天门市"]
			aCity[3] = ["--请选择--", "广州市", " 从化市", "深圳市 ", "珠海市", " 汕头市", "  韶关市", " 乐昌市", " 佛山市 ", "江门市", " 台山市", " 湛江市", " 廉江市", " 茂名市", "  高州市", " 肇庆市 ", "高要市", " 惠州市", " 梅州市", " 兴宁市", " 汕尾市", " 陆丰市", " 河源市", " 阳江市", " 阳春市", " 清远市 ", " 英德市",
				" 东莞市 ", "中山市", "  潮州市", " 揭阳市", " 普宁市", " 云浮市"]
			aCity[4] = ["--请选择--", "南宁市", "柳州市", "桂林市", "梧州市", "北海市", "防城港市", "钦州市", "贵港市", "玉林市", "百色市", "贺州市", "河池市", "来宾市", "崇左市"]

			aCity[5] = ["--请选择--", "郑州", "开封", "洛阳", "南阳", "漯河", "许昌", "三门峡", "平顶山", "周口", "驻马店", "新乡", "鹤壁", "焦作", "濮阳", "安阳", "商丘", "信阳", "济源"]
			aCity[6] = ["--请选择--", "石家庄", "张家口", "承德", "秦皇岛", "唐山", "廊坊", "保定", "沧州", "衡水", "邢台", "邯郸"]
			aCity[7] = ["--请选择--", "济南市", "德州市", "聊城市", "菏泽市", "泰安市", "莱芜市", "济宁市", "枣庄市", "临沂市", "日照市", "青岛市", "威海市", "烟台市", "潍坊市", "淄博市", "东营市", "滨州市"]
			aCity[8] = ["--请选择--", "太原", "晋城", "大同", "朔州", "阳泉", "长治", "忻州", "晋中", "临汾", "运城", "晋城", "吕梁"]
			aCity[9] = ["--请选择--", "南京", "徐州", "连云港", "宿迁", "淮安", "扬州", "盐城", "南通", "泰州", "苏州", "常州", "无锡", "镇江"]
			aCity[10] = ["--请选择--", "杭州市", "宁波市", "温州市", "嘉兴市", "湖州市", "绍兴市", "金华市", "衢州市", "舟山市", "台州市", "丽水市"]
			aCity[11] = ["--请选择--", "南昌", "九江", "景德镇", "萍乡", "新余", "鹰潭", "赣州", "宜春", "上饶", "吉安", "抚州"]
			aCity[12] = ["--请选择--", "哈尔滨", "齐齐哈尔", "牡丹江", "佳木斯", "大庆", "鸡西", "双鸭山", "鹤岗", "绥化", "七台河", "伊春", "黑河", "大兴安岭"]
			aCity[13] = ["--请选择--", "乌鲁木齐市", "克拉玛依市"]
			aCity[14] = ["--请选择--", "昆明市", "曲靖市", "玉溪市", "昭通市", "楚雄市", "普洱市", "景洪市", "大理市", "保山市", "丽江市", "临沧市", "宣威市", "个旧市", "文山市", "安宁市", "瑞丽市", "芒市"]
			aCity[15] = ["--请选择--", "贵阳", "遵义", "安顺", "都匀", "六盘水市"]
			aCity[16] = ["--请选择--", "福州市", "厦门市", "泉州市", "龙岩市", "南平市", "宁德市", "莆田市", "三明市", "漳州市"]
			aCity[17] = ["--请选择--", "长春市", "九台市", "榆树市", "德惠市", "吉林市", "蛟河市", "桦甸市", "舒兰市", "磐石市", "四平市", "公主岭市", "双辽市", "辽源市", "通化市", "梅河口市", "集安市", "白山市", "临江市", "松原市", "白城市", "洮南市", "大安市", "延吉市", "图们市", "敦化市", "珲春市", "龙井市", "和龙市"]
			aCity[18] = ["--请选择--", "合肥市", "芜湖市", "蚌埠市", "淮南市", "马鞍山市", "淮北市", "铜陵市", "安庆市", "桐城市", "黄山市", "滁州市", "阜阳市", "巢湖市", "六安市", "亳州市", "池州市", "宣城市"]
			aCity[19] = ["--请选择--", "成都市", "自贡市", "攀枝花市", "泸州市", "德阳市", "绵阳市", "广元市", "遂宁市", "内江市", "乐山市", "南充市", "眉山市", "宜宾市", "广安市", "达州市", "雅安市", "巴中市", "资阳市", "阿坝藏族羌族自治州", "甘孜藏族自治州", "凉山彝族自治州"]
			aCity[20] = ["--请选择--", "拉萨"]
			aCity[21] = ["--请选择--", "银川市", "青铜峡市", "吴忠市", "石嘴山市", "固原市", "灵武市", "中卫市", "中宁市", "永宁县"]
			aCity[22] = ["--请选择--", "沈阳市", "大连市", "鞍山市", "抚顺市", "本溪市", "丹东市", "锦州市", "营口市", "阜新市", "辽阳市", "盘锦市", "铁岭市", "朝阳市", "葫芦岛市"]
			aCity[23] = ["--请选择--", "西宁市"]
			aCity[24] = ["--请选择--", "兰州市", "嘉峪关市", "金昌市", "白银市", "天水市", "武威市", "张掖市", "酒泉市", "平凉市", "庆阳市", "定西市", "陇南市", "临夏回族自治州", "甘南藏族自治州"]
			aCity[25] = ["--请选择--", "西安", "宝鸡", "咸阳", "渭南", "商洛", "安康", "汉中", "铜川", "延安", "榆林"]
			aCity[26] = ["--请选择--", "呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "鄂尔多斯市", "呼伦贝尔市", "巴彦淖尔市", "乌兰察布市"]
			aCity[27] = ["--请选择--", "台北", "高雄市"]
			aCity[28] = ["--请选择--", "北京市"]
			aCity[29] = ["--请选择--", "上海市"]
			aCity[30] = ["--请选择--", "天津市"]
			aCity[31] = ["--请选择--", "文昌", "琼海", "万宁", "三亚", "陵水", "乐东", "昌江", "东方", "海口", "澄迈", "临高", "瞻州", " 定安", "屯昌", "琼中", "白沙", "五指山", "保亭"]
			aCity[32] = ["--请选择--", "重庆市"]
			aCity[33] = ["--请选择--", "香港岛", "九龙", "新界东", "新界"]
			aCity[34] = ["--请选择--", "澳门特别行政区"]

			function ChangeCity() {
				var i, iProvinceIndex;
				iProvinceIndex = document.getElementById("sheng").selectedIndex;
				iCityCount = 0;
				while(aCity[iProvinceIndex][iCityCount] != null)
					iCityCount++;
				//计算选定省份的城市个数
				document.getElementById("shi").length = iCityCount; // 改变下拉列表的选项数
				for(i = 0; i <= iCityCount - 1; i++)
					document.getElementById("shi")[i] = new Option(aCity[iProvinceIndex][i]);
				document.getElementById("shi").focus();

			}